#+TITLE: Understaning Pin for C and C++ Developers
#+DATE: 2019-05-25

My initial impression of [[https://doc.rust-lang.org/std/pin/][Pin]] was that it said "hey there's something
sitting at this memory location. Feel free to use it, even though, in
this context, the compiler can't lexically prove that it is actually
still there." My understanding of =Pin= was roughly that it was a
backdoor through the lifetime system.

Opening up the documentation, the page starts with a discussion about
=Unpin=. =Unpin= is weird. Basically, =Unpin= says "yeah I know this
is pinned but you are free to ignore that." My gut reaction to =Unpin=
was "why would you need this at all?" Doesn't this defeat the purpose
of =Pin=?  Why is everything =Unpin= by default???

Continuing on, hoping for some redemption further down the page,
there's a list of rules which must be adhered to in the =unsafe=
constructor for =Pin=. I found this constraint for types which are
=!Unpin= to be paricularly mysterious:

#+begin_quote
It must not be possible to obtain a =&mut P::Target= and then move out
of that reference (using, for example =mem::swap=).
#+end_quote

Other guides to =Pin= also noted that calling =mem::replace=, which
also takes a mutable mutable reference, should not be allowed.

There's a number of fantastic examples in the rust documentation, but
I still was missing something. The rest of this post will be a
walkthrough of where I went wrong.

Let's look at this again:

#+begin_quote
It must not be possible to obtain a =&mut P::Target= and then *move out*
of that reference (using, for example =mem::swap=).
#+end_quote

Clearly moving is significant here, what does that mean exactly, and
why is this such a big deal?

*** C++

I'm more familar with C++ and my familiarty is probably where my
misunderstandings are coming from. Let's start by understanding what
it means to move something in C++.

Consider the following struct:

#+name: ThingDef
#+begin_src cpp
  struct Thing {
    Thing(uint64_t id)
      : id(id)
    { }

    // The move constructor is only required to leave the object in a
    // well defined state
    Thing(Thing&& other)
      : id(other.id)
    {
      other.id = 0;
    }

    Thing& operator=(Thing&& other)
    {
      id       = other.id;
      other.id = 0;
      return *this;
    }

    // non-copyable for clarity
    Thing(Thing const&)            = delete;
    Thing& operator=(Thing const&) = delete;

    uint64_t id;
  };
#+end_src

C++ says that a move ctor must leave the object moved from in an
undefined, *but valid* state.

#+begin_src cpp :noweb yes :includes <cstdint> <cstdio> <algorithm>
  <<ThingDef>>

  int main() {
    Thing a(10);
    Thing const& ref = a;

    Thing c = std::move(a);      // moves a, but leave in defined state
    printf("ref %zu\n", ref.id); // prints 0
  }
#+end_src

#+RESULTS:
: ref 0

Next, consider this (probably wrong in some subtle way) implementation
of =swap=, and it's usage:

#+begin_src cpp :noweb yes :includes <cstdint> <cstdio> <algorithm>
  <<ThingDef>>

  template <typename T>
  void swap(T& a, T& b)
  {
    T tmp = std::move(a); // lots of moves
    a = std::move(b);     // move again
    b = std::move(tmp);   // oh look, move again!
  }

  int main() {
    Thing a(1);
    Thing b(2);

    Thing& ref = a;
    swap(a, b);
    printf("ref %zu\n", ref.id); // prints 2
  }
#+end_src

#+RESULTS:
: ref 2

As far as I know, this is totally valid C++. The reference is just a
pointer to some chunk of memory, and, all of the moves that we did are
defined to leave the moved-from object in a "valid" state (you might
just have to be careful with them).

Let's consider one last struct.

#+name: RBDef
#+begin_src cpp
  template <typename T, size_t N>
  struct ring_buffer {
    std::array<T, N+1> entries; // use one extra element for easy book-keeping

    // Store pointers. This is bad, there are better ways to make a ring
    // buffer, but the demonstration is useful.
    T* head = entries;
    T* tail = head+1;

    // ...
  };
#+end_src

=head= and =tail= both point to elements of entries.  C++ will
generate a default move contructor for us, but the default is just a
=memcpy=. If it runs, we'll end up with pointers that point into the
wrong array. We must write a custom move constructor.

#+begin_src cpp
  ring_buffer(ring_buffer&& other)
    : entries( std::move(other.entries) )
    , head( entries.data() + (other.head - other.entries.data())) // adjust pointer
    , tail( entries.data() + (other.tail - other.entries.data())) // adjust pointer
  {
    other.head = other.entries.data();
    other.tail = other.head + 1;
  }
#+end_src

So, in C++, a =move= is just another user defined operation that you
can take advantage of in some special places, perhaps to make code
more efficient or provide some useful semantic for your users.

